![CAS Manchester Logo](http://casmanchester.org.uk/images/poster-image.png)

# Pandas for Teachers

## An Introduction

### By Dave Ames 

#### E: david.john.ames@gmail.com / dave.ames@computingatschool.org.uk
#### T: @davidames

Before we do anything else, we need to generate some data to work on. Please take a minute to go to this [Google Form](https://goo.gl/forms/0z9uk5jWlfIp1KAf2) and fill out some data about yourself (only share things you are willing to make public). Thanks!

Once this is done, you'll all need to grab a copy of the results. Go [here](https://drive.google.com/drive/folders/0B0ZesRdIs8dMOXVreUE5WmhNZFE?usp=sharing) to get a copy of the CSV file.

Rename it (if necessary to results.csv and save it in the same directory as this ipynb file)

First of all we need to do some import statements. These can go anywhere in your code, but it's arguably easier to maintain, if all of the imports are kept together in the same cell. So if you need to add anymore modules later on, add the import statement in the next cell and re-evaluate it.

To run the cell either put the cursor in the cell and click on the **run** icon above, or place your cursor in the cell and press **CTRL** and **ENTER** together. (**SHIFT** and **ENTER** also works).

In [1]:
import pandas as pd

Now we are going to load up our CSV file into a Pandas DataFrame. This is a special data structure that has many methods attached that allow it to behave like a Python version of a spreadsheet or a table, but stored in a variable in your program.

Run the code below by clicking into the cell and doing the same as before.

You should see a number appear in the square brackets to the left of the cell, this tells you that the cell has successfully been evaluated (an asterisk appears first to show that the code is in the process of being run). The number equates to what order the cells have been run in.

In [2]:
my_data_frame = pd.read_csv("responses.csv")

To see what's inside any variable at any given point we can just put the name of the variable on its' own and evaluate it, this is the same as in the standard Python Shell, as the Notebook is essentially a souped up version of the Python Shell on serious amounts of steroids.

In [3]:
my_data_frame

,Timestamp,First Name,Surname,Age,Main Mode of Transport to the Conference,Approximate Distance Travelled (Miles),Approximate Journey Time (Hours),Postcode,Number of hours sleep
0,NaN,Gareth,Allen,25,Car,100,11,TF1 1NY,9
1,NaN,Helen,Baron,45,Plane,237,9,LE8 4FE,5
2,NaN,Dee,Chamberlain,56,Train,261,0,PL1 2DA,9
3,NaN,Martin,Gaughan,27,Boat,14,2,LE14 3JJ,7
4,NaN,Kirsten,Hardy,32,Cycle,148,3,SS12 9GJ,7
5,NaN,Sophie,Jacques,35,Car,201,0,BA8 0HP,2
6,NaN,Catherine,Jermyn,41,Plane,178,0,WR6 6AA,2
7,NaN,Deborah,Mercer,21,Bus,161,7,CV11 5EL,8
8,NaN,Liane,O'Kane,40,Plane,256,2,PE26 1DG,4
9,NaN,Martyn,Soulsby,45,Car,44,1,NG15 9BN,5
10,NaN,Kathy,Spence,34,Plane,96,9,LS16 5EA,1
11,NaN,Najam,Ahmed,50,Car,261,11,M18 8PF,5
12,NaN,Umar-Farooq,Ali,46,Train,126,3,NG17 7NZ,7
13,NaN,Maureen,Anderson,45,Boat,141,4,ST2 8BS,6
14,NaN,Wendy,Bowe,46,Boat,222,11,B67 5LR,0
15,NaN,John,Brew,34,Cycle,169,4,DL3 8JA,6
16,NaN,Mark,Capaldi,46,Car,197,7,B67 5LT,4
17,NaN,Helen,Catterall,34,Car,210,1,DL3 8NN,8
18,NaN,Saqib,Chaudhry,54,Plane,260,9,S8 0BN,7
19,NaN,Roger,Davies,60,Train,16,11,SE12 8JP,9
20,NaN,Martin,Eccleshare,37,Boat,160,4,CB5 8ND,0
21,NaN,John,Evason,35,Cycle,280,0,SN25 4GY,10
22,NaN,Phil,Hackett,31,Car,167,5,MK42 9XA,2
23,NaN,Neil,Ireland,33,Plane,215,3,WR10 1DF,3
24,NaN,Khawer,Ishtiaq,29,Car,126,2,HX2 9DG,3
25,NaN,Phil,Jackson,37,Car,172,8,WR10 1DF,11
26,NaN,Alan,O'Donohoe,47,Train,281,5,LE4 5LB,4
27,NaN,Emma,Partridge,44,Boat,1,6,SM4 6NY,10
28,NaN,Theresa,Russell,46,Boat,169,6,WS3 2RP,3
29,NaN,Kathy,Taylor,60,Cycle,265,8,NG18 3AF,6

We can access the data in a variety of ways, but normally we want to use the column headings as a way of identifying the columns. These default to the values that we had when importing the data. We can change these, in code, in a bit as the existing ones are likely to be problematic when we come to reference them. Alternatively we could edit the column headings in the CSV file before we import it.

In [4]:
my_data_frame.columns

Index(['Timestamp', 'First Name', 'Surname', 'Age',
       'Main Mode of Transport to the Conference',
       'Approximate Distance Travelled (Miles)',
       'Approximate Journey Time (Hours)', 'Postcode',
       'Number of hours sleep'],
      dtype='object')

The index on the rows is much simpler as it defaults to numbering the rows, individually. We can if we choose (and providing the values are unique) assign another column to be the index, but with the current dataset it's probably easier to just use the preassigned indices (the plural of index).

In [5]:
my_data_frame.index

RangeIndex(start=0, stop=30, step=1)

We can also look at the shape our DataFrame makes, notice that neither the column headings, row, nor the index column are counted as being part of the data. Instead it returns a tuple telling us how many columns and how many rows are in the dataset. If you are looking at a spreadsheet of the data then the numbers on the rows won't match, can you work out why?

In [6]:
my_data_frame.shape

(30, 9)

We can rename the columns in a number of ways, one is to create a list of the new column names and assign them to a special attribute of the data frame called columns (in our case this will be: **my_data_frame.columns = [...]**)

You can call the columns anything you want, but for now it's probably easiest to make them the same as mine.

In [11]:
my_data_frame.columns = ["timestamp", "firstname", "surname", "age", 
                         "transport", "distance", "time", "postcode", "sleep"]

In [12]:
my_data_frame

,timestamp,firstname,surname,age,transport,distance,time,postcode,sleep
0,NaN,Gareth,Allen,25,Car,100,11,TF1 1NY,9
1,NaN,Helen,Baron,45,Plane,237,9,LE8 4FE,5
2,NaN,Dee,Chamberlain,56,Train,261,0,PL1 2DA,9
3,NaN,Martin,Gaughan,27,Boat,14,2,LE14 3JJ,7
4,NaN,Kirsten,Hardy,32,Cycle,148,3,SS12 9GJ,7
5,NaN,Sophie,Jacques,35,Car,201,0,BA8 0HP,2
6,NaN,Catherine,Jermyn,41,Plane,178,0,WR6 6AA,2
7,NaN,Deborah,Mercer,21,Bus,161,7,CV11 5EL,8
8,NaN,Liane,O'Kane,40,Plane,256,2,PE26 1DG,4
9,NaN,Martyn,Soulsby,45,Car,44,1,NG15 9BN,5
10,NaN,Kathy,Spence,34,Plane,96,9,LS16 5EA,1
11,NaN,Najam,Ahmed,50,Car,261,11,M18 8PF,5
12,NaN,Umar-Farooq,Ali,46,Train,126,3,NG17 7NZ,7
13,NaN,Maureen,Anderson,45,Boat,141,4,ST2 8BS,6
14,NaN,Wendy,Bowe,46,Boat,222,11,B67 5LR,0
15,NaN,John,Brew,34,Cycle,169,4,DL3 8JA,6
16,NaN,Mark,Capaldi,46,Car,197,7,B67 5LT,4
17,NaN,Helen,Catterall,34,Car,210,1,DL3 8NN,8
18,NaN,Saqib,Chaudhry,54,Plane,260,9,S8 0BN,7
19,NaN,Roger,Davies,60,Train,16,11,SE12 8JP,9
20,NaN,Martin,Eccleshare,37,Boat,160,4,CB5 8ND,0
21,NaN,John,Evason,35,Cycle,280,0,SN25 4GY,10
22,NaN,Phil,Hackett,31,Car,167,5,MK42 9XA,2
23,NaN,Neil,Ireland,33,Plane,215,3,WR10 1DF,3
24,NaN,Khawer,Ishtiaq,29,Car,126,2,HX2 9DG,3
25,NaN,Phil,Jackson,37,Car,172,8,WR10 1DF,11
26,NaN,Alan,O'Donohoe,47,Train,281,5,LE4 5LB,4
27,NaN,Emma,Partridge,44,Boat,1,6,SM4 6NY,10
28,NaN,Theresa,Russell,46,Boat,169,6,WS3 2RP,3
29,NaN,Kathy,Taylor,60,Cycle,265,8,NG18 3AF,6

The Timestamp column isn't really relevant to our data so we're going to remove it and store the resulting dataframe into a new variable. 

What we actually do is select all of the rows *the colon before the first comma*, and the columns *starting from the one called "firstname" up to and including the column called "sleep"*. Pandas uses a variation of the Python slice notation from lists and strings here (the colons). If you aren't familiar with the slice notation go here for a overview - [StackOverflow](https://stackoverflow.com/questions/509211/understanding-pythons-slice-notation)

In [17]:
my_df = my_data_frame.loc[:, "firstname":"sleep"]

In [18]:
my_df

      firstname      surname  age transport  distance  time  postcode  sleep
0        Gareth        Allen   25       Car       100    11   TF1 1NY      9
1         Helen        Baron   45     Plane       237     9   LE8 4FE      5
2           Dee  Chamberlain   56     Train       261     0   PL1 2DA      9
3        Martin      Gaughan   27      Boat        14     2  LE14 3JJ      7
4       Kirsten        Hardy   32     Cycle       148     3  SS12 9GJ      7
5        Sophie      Jacques   35       Car       201     0   BA8 0HP      2
6     Catherine       Jermyn   41     Plane       178     0   WR6 6AA      2
7       Deborah       Mercer   21       Bus       161     7  CV11 5EL      8
8         Liane       O'Kane   40     Plane       256     2  PE26 1DG      4
9        Martyn      Soulsby   45       Car        44     1  NG15 9BN      5
10        Kathy       Spence   34     Plane        96     9  LS16 5EA      1
11        Najam        Ahmed   50       Car       261    11   M18 8PF      5
12  Umar-Farooq          Ali   46     Train       126     3  NG17 7NZ      7
13      Maureen     Anderson   45      Boat       141     4   ST2 8BS      6
14        Wendy         Bowe   46      Boat       222    11   B67 5LR      0
15         John         Brew   34     Cycle       169     4   DL3 8JA      6
16         Mark      Capaldi   46       Car       197     7   B67 5LT      4
17        Helen    Catterall   34       Car       210     1   DL3 8NN      8
18        Saqib     Chaudhry   54     Plane       260     9    S8 0BN      7
19        Roger       Davies   60     Train        16    11  SE12 8JP      9
20       Martin   Eccleshare   37      Boat       160     4   CB5 8ND      0
21         John       Evason   35     Cycle       280     0  SN25 4GY     10
22         Phil      Hackett   31       Car       167     5  MK42 9XA      2
23         Neil      Ireland   33     Plane       215     3  WR10 1DF      3
24       Khawer      Ishtiaq   29       Car       126     2   HX2 9DG      3
25         Phil      Jackson   37       Car       172     8  WR10 1DF     11
26         Alan    O'Donohoe   47     Train       281     5   LE4 5LB      4
27         Emma    Partridge   44      Boat         1     6   SM4 6NY     10
28      Theresa      Russell   46      Boat       169     6   WS3 2RP      3
29        Kathy       Taylor   60     Cycle       265     8  NG18 3AF      6

If we want to do **things** to parts of the data, we can slice and dice it in a variety of ways...

For instance to get to an individual "cell" in the dataframe, we refer to it by its' exact row and column (in that order and use the **.at** command).

Basically it looks like:  
**some_data_frame.at[row_index, column_name_in_quotes]**

In [25]:
my_df.at[2, "age"]

56

We can also select individual rows, by using the **.loc** keyword like this:  
**some_data_frame.loc[row_index]**

In [27]:
my_df.loc[4]

firstname     Kirsten
surname         Hardy
age                32
transport       Cycle
distance          148
time                3
postcode     SS12 9GJ
sleep               7
Name: 4, dtype: object

Similarly we can get to individual columns, but this time we can just use the dataframe's name and the column name:
**some_data_frame[column_name_in_quotes]**

In [28]:
my_df["sleep"]

0      9
1      5
2      9
3      7
4      7
5      2
6      2
7      8
8      4
9      5
10     1
11     5
12     7
13     6
14     0
15     6
16     4
17     8
18     7
19     9
20     0
21    10
22     2
23     3
24     3
25    11
26     4
27    10
28     3
29     6
Name: sleep, dtype: int64

The first column that displays is the index.

There are a whole host of mathematical operations we can perform on columns. Each time we use the above notation to specify the column we want.

Here's how to find the mean:  
**some_data_frame[column_name_in_quotes].mean()**

In [29]:
my_df["age"].mean()

40.5

Try running it on some of the other numerical columns. What happens if you run it on the "firstname" column? What happens if you apply it to a row.

We can do similar things to find the median and the mode.

In [33]:
my_df["sleep"].median()

5.5

In [35]:
my_df["sleep"].mode()

0    7
dtype: int64

We can also use mode on text based columns as it works with categorical data too.

In [36]:
my_df["transport"].mode()

0    Car
dtype: object